# GetStairsOnLevel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultistoryStairs..::..GetStairsOnLevel Method
MultistoryStairs Class See Also
---
Gets the individual stairs or stairs group on the given base level.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Stairs GetStairsOnLevel(
	ElementId levelId
)
```

Visual Basic
---
```text
Public Function GetStairsOnLevel ( _
	levelId As ElementId _
) As Stairs
```

Visual C++
---
```text
public:
Stairs^ GetStairsOnLevel(
	ElementId^ levelId
)
```

# ### Parameters
levelId
    Type: Autodesk.Revit.DB..::..ElementId The base level id.
# ### Return Value
The id of stairs element on the given level.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace